{"data":{"site":{"siteMetadata":{"title":"Feed the Gillmores"}},"contentfulRecipe":{"title":"Stir-Fried Sesame Shrimp and Spinach","slug":"stir-fried-sesame-shrimp-and-spinach","yields":"3 to 4 servings","time":"About 15 minutes","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2012/04/13/health/nutrition/13recipehealth/13recipehealth-articleLarge-v3.jpg","source":"https://cooking.nytimes.com/recipes/12382-stir-fried-sesame-shrimp-and-spinach","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>1 pound large shrimp, peeled and deveined</li>\n<li>Salt to taste</li>\n<li>⅛ teaspoon sugar (leave out for diet friendly!)</li>\n<li>2 tablespoons canola oil or light sesame oil</li>\n<li>1 tablespoon minced ginger</li>\n<li>1 tablespoon minced garlic</li>\n<li>¼ to ½ teaspoon crumbled dried red chili</li>\n<li>2 tablespoons sesame seeds</li>\n<li>1 generous bunch spinach (about 1 pound), stems trimmed at the end, rinsed in 2 changes water</li>\n<li>2 teaspoons dark sesame oil</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Place the shrimp in a large colander and rinse with water. Sprinkle generously with salt and toss together for about a minute. Rinse with water and repeat. After rinsing one more time, drain on paper towels. Pat dry with more paper towels.</p>\n</li>\n<li>\n<p>Combine 1/4 to 1/2 teaspoon salt (to taste) and the sugar in a small bowl and place close to your wok.</p>\n</li>\n<li>\n<p>Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil by adding it to the sides of the pan and swirling the pan, then add the garlic, ginger and chili flakes and stir-fry for no more than 10 seconds. Push to the sides of the pan and add the shrimp in one layer. Let cook undisturbed for 1 minute, then add the remaining oil and stir-fry for 1 minute.</p>\n</li>\n<li>\n<p>Add the sesame seeds and spinach and stir-fry for 1 minute, until it has begun to wilt but the wilting is still uneven. Add the salt and sugar, sprinkling it evenly over the spinach, and continue to stir-fry until the spinach has wilted but is still bright and the shrimp are cooked through and bright pink, about 2 more minutes. Remove from the heat, drizzle on the sesame oil, toss together and serve, with rice, noodles or other grains.</p>\n</li>\n<li>\n<p>Advance preparation: You can prepare the shrimp through Step 1 several hours ahead.</p>\n</li>\n</ol>"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"stir-fried-sesame-shrimp-and-spinach"}}