{"data":{"site":{"siteMetadata":{"title":"Feed the Gillmores"}},"allContentfulRecipe":{"edges":[{"node":{"title":"Broccoli and Scallions With Thai-Style Vinaigrette","slug":"broccoli-and-scallions-with-thai-style-vinaigrette","yields":"4 servings","time":"20 minutes","tags":["side"],"linkToImage":"https://static01.nyt.com/images/2018/10/10/dining/ch-roasted-broccoli-vinaigrette/merlin_144808386_b4aedd89-d5cf-494e-8065-ab872997a546-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1019655-broccoli-and-scallions-with-thai-style-vinaigrette","ingredientsLong":{"childMarkdownRemark":{"html":"<p>FOR THE BROCCOLI AND SCALLIONS:\n1 ½  pounds broccoli (about 3 good-sized crowns and their stems), cut into florets\n4  scallions, cut into 2-inch pieces\n4  tablespoons olive oil\nKosher salt and black pepper</p>\n<p>FOR THE VINAIGRETTE:\n¼  cup freshly squeezed lime juice (from 1 to 2 limes)\n1  scallion, finely chopped\n1 ½  teaspoons light brown sugar\n½  teaspoon red-pepper flakes, plus more to taste\n2  tablespoons fish sauce\n1  tablespoon finely chopped cilantro\n1  tablespoon finely chopped mint</p>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Heat the oven to 425 degrees. In a large bowl, toss the broccoli and scallions with the olive oil. Season well with salt and pepper and toss again. Spread the mixture evenly onto a large sheet pan and roast until crisp and golden, about 15 to 20 minutes, tossing halfway through to ensure even cooking.</p>\n</li>\n<li>\n<p>While the vegetables roast, make the vinaigrette: In a small bowl, whisk all the ingredients until the brown sugar is dissolved. Taste and adjust seasoning if needed.</p>\n</li>\n<li>\n<p>Place the broccoli and scallions in a bowl and toss with the vinaigrette. Serve right away or the vegetables will become soggy.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Cinnamon Roll Bread","slug":"cinnamon-roll-bread","yields":"One 9-inch loaf","time":"1 hour 30 minutes, plus 2 hours’ rising","tags":["breakfast"],"linkToImage":"https://static01.nyt.com/images/2019/04/15/dining/em-cinnamon-roll-bread/merlin_153444012_bb5224dc-cced-491b-ae17-9c06436b1a04-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1020179-cinnamon-roll-bread","ingredientsLong":{"childMarkdownRemark":{"html":"<h3>FOR THE DOUGH:</h3>\n<ul>\n<li>Nonstick cooking spray</li>\n<li>1  cup/240 milliliters whole milk</li>\n<li>3  cups/385 grams all-purpose flour</li>\n<li>⅓  cup/65 grams granulated sugar</li>\n<li>2  teaspoons instant yeast</li>\n<li>½  teaspoon fine sea salt</li>\n<li>6  tablespoons/85 grams unsalted butter (3/4 stick), at room temperature</li>\n<li>1  large egg, at room temperature</li>\n</ul>\n<h3>FOR THE FILLING AND FINISHING:</h3>\n<ul>\n<li>8  tablespoons/115 grams unsalted butter (1 stick), melted</li>\n<li>⅔  cup/145 grams light brown sugar</li>\n<li>¼  cup/30 grams all-purpose flour, plus more for rolling</li>\n<li>2 ½  teaspoons ground cinnamon</li>\n<li>½  teaspoon vanilla extract</li>\n<li>¼  teaspoon fine sea salt</li>\n<li>1  large egg</li>\n</ul>\n<h3>FOR THE GLAZE:</h3>\n<ul>\n<li>1  cup/125 grams confectioners’ sugar</li>\n<li>3  tablespoons heavy cream, plus more as needed</li>\n<li>1  teaspoon vanilla extract</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Grease a 9-inch loaf pan with nonstick cooking spray and line with a parchment paper sling, leaving a 2-inch overhang on the long sides.</p>\n</li>\n<li>\n<p>Pour the milk into a small pot and heat over low until it’s just warm to the touch (about 95 degrees). If needed, let cool to the correct temperature before using.</p>\n</li>\n<li>\n<p>While the milk heats, in the bowl of an electric mixer fitted with the dough hook, mix the flour, granulated sugar, yeast and salt to combine. Add the warm milk, butter and egg and mix on low speed until the dough comes together, about 3 minutes. Scrape the bowl well, and mix on medium speed for another 3 minutes.</p>\n</li>\n<li>\n<p>Transfer to a lightly greased medium bowl and cover with plastic wrap. Let rise until puffy and almost doubled in size, 45 minutes to 1 hour.</p>\n</li>\n<li>\n<p>While the dough rises, make the filling: In a medium bowl, whisk the butter and brown sugar until well combined. Whisk in the flour, cinnamon, vanilla and salt until well incorporated.</p>\n</li>\n<li>\n<p>When the dough has risen, roll it out into into a rectangle (about 12 by 20 inches) on a lightly floured surface using a lightly floured rolling pin. Spread the filling over the dough in an even layer all the way to the edges. Starting on one of the long sides, tightly roll up the dough crosswise into a 20-inch log. Gently stretch the log to make it about 24 inches long.</p>\n</li>\n<li>\n<p>Use a sharp or serrated knife to cut the dough into 16 1 1/2-inch-thick pieces. Arrange the cinnamon rolls in the loaf pan: Place two rows of six pieces each at the bottom of the pan, side-by-side, seam-side down and tightly packed with the swirls facing the ends of the pan. Arrange the remaining four pieces in the center on top of those on the bottom.</p>\n</li>\n<li>\n<p>Loosely cover the loaf with plastic wrap and let rise until the dough comes about 1 inch over the top edge of the pan, about 1 hour (it can be more if your room temperature is cooler). Toward the end of the rise time, heat the oven to 350 degrees.</p>\n</li>\n<li>\n<p>Make an egg wash by lightly beating one egg and 1 tablespoon water together. Brush the loaf with the egg wash, then bake until the loaf has an internal temperature of 200 degrees, about 50 to 55 minutes. The loaf will brown quickly; tent it with foil after 20 to 25 minutes for the remainder of baking time.</p>\n</li>\n<li>\n<p>While the loaf bakes, make the glaze: In a medium bowl, whisk the confectioners’ sugar, cream and vanilla to combine. The mixture should be thick, more like a frosting than a glaze. Add more cream if needed to achieve a smooth texture. Cover with plastic wrap, pressing the wrap into the surface of the frosting so the surface doesn’t harden.</p>\n</li>\n<li>\n<p>Let the bread cool in the pan for 15 minutes. Use a small offset spatula to loosen the loaf from the short edges of the pan, then lift out the loaf using the parchment paper and cool for at least 30 minutes on a cooling rack before applying the frosting. Spread the frosting in an even layer over the surface of the loaf.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Crispy Feta With Lemon","slug":"crispy-feta-with-lemon","yields":"About 16 servings","time":"10 minutes","tags":["snack","side"],"linkToImage":"https://static01.nyt.com/images/2018/12/22/dining/22as-crispy-feta/as-crispy-feta-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1019802-crispy-feta-with-lemon","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>1  (8-ounce) package block feta, preferably not in brine</li>\n<li>3  tablespoons cornstarch</li>\n<li>1  tablespoon sesame seeds</li>\n<li>2  tablespoons unsalted butter</li>\n<li>Flaky salt</li>\n<li>Freshly ground black pepper</li>\n<li>Red-pepper flakes, for serving</li>\n<li>Lemon wedges, for serving</li>\n<li>Crackers or toasted baguette slices, for serving</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Cut the feta in 1/4-inch-thick slices, then cut each rectangular slice in half crosswise to form two squares. You should end up with about 16 squares. Transfer the squares to a paper towel on your cutting board and pat dry.</p>\n</li>\n<li>\n<p>In a large shallow bowl or rimmed plate, stir together the cornstarch and sesame seeds. Working with one at a time, gently coat the feta on both sides with the cornstarch mixture.</p>\n</li>\n<li>\n<p>In a large, nonstick skillet, melt the butter over medium heat. Add the feta in a single layer and cook until golden-brown, about 1 minute. Using a spatula, gently flip and cook until golden-brown on the other side. Transfer to a platter and sprinkle with flaky salt, black pepper and red-pepper flakes. Serve warm with crackers or toasted baguette slices, with lemon wedges alongside for squeezing on top.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Cucumber Salad With Roasted Peanuts and Chile","slug":"cucumber-salad-with-roasted-peanuts-and-chile","yields":"2 - 4 servings","time":"15 minutes","tags":["salad","lunch","dinner"],"linkToImage":"https://static01.nyt.com/images/2019/05/02/dining/sl-cucumber-salad/merlin_153444042_d4e426e3-54b2-4d6f-a1f2-82fdb61b9122-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1020217-cucumber-salad-with-roasted-peanuts-and-chile","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>6  Persian cucumbers (about 1 pound), cut lengthwise into thin spears then cut crosswise into 2-inch pieces</li>\n<li>Kosher salt</li>\n<li>¼  cup salted roasted peanuts</li>\n<li>¼  cup cilantro leaves</li>\n<li>1  teaspoon red-pepper flakes</li>\n<li>3  tablespoons natural unsalted peanut butter</li>\n<li>2  tablespoons soy sauce</li>\n<li>2  tablespoons unseasoned rice vinegar</li>\n<li>1  teaspoon granulated sugar</li>\n<li>1  small clove garlic, grated</li>\n<li>Chile oil, store bought or homemade, for serving (optional)</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Toss cucumbers with 1/2 teaspoon kosher salt in a colander. Set aside to drain.</p>\n</li>\n<li>\n<p>Chop peanuts, cilantro and red-pepper flakes together until very fine. Set aside.</p>\n</li>\n<li>\n<p>In a large bowl, whisk together peanut butter, soy sauce, rice vinegar, sugar, garlic and 1/2 teaspoon kosher salt. Add up to 1 tablespoon water, if needed to thin mixture. Transfer salted cucumbers to the bowl with dressing and toss to coat.</p>\n</li>\n<li>\n<p>To serve, place half the cucumber salad on the plate, sprinkle with half the peanut mixture. Repeat with the remaining cucumber salad and peanut mixture. Drizzle with chile oil, if using, and serve immediately.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Curried Chicken Breast with Zucchini","slug":"curried-chicken-breast-with-zucchini","yields":"4 servings","time":"15 minutes","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2017/02/17/dining/17COOKING-CURRYCHIX-ZUCCHINI1/17COOKING-CURRYCHIX-ZUCCHINI1-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/3209-curried-chicken-breast-with-zucchini","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>4 boneless, skinless chicken breasts (about 1 1/4 pounds)</li>\n<li>2 tablespoons olive oil</li>\n<li>Salt to taste if desired</li>\n<li>Freshly ground pepper to taste</li>\n<li>1 zucchini, about 1/2 pound, ends trimmed</li>\n<li>2 teaspoons curry powder</li>\n<li>1 tablespoon butter</li>\n<li>2 tablespoons finely chopped shallots</li>\n<li>½ cup chicken broth</li>\n<li>2 tablespoons heavy cream</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Put chicken pieces in a bowl and add 1 tablespoon of the oil, salt and pepper.</p>\n</li>\n<li>\n<p>Trim off the ends of the zucchini and cut it into 12 rounds, each about 1/2-inch thick. Add zucchini and curry powder to the chicken and blend well with the fingers to coat the pieces evenly.</p>\n</li>\n<li>\n<p>Heat the remaining 1 tablespoon of oil in a heavy skillet and add the chicken pieces in one layer. Scatter the zucchini rounds between the chicken pieces, preferably in one layer. Cook over moderately high heat until chicken pieces are nicely browned on one side, about 3 minutes. Turn the chicken pieces and the zucchini rounds and cook over moderately low heat about 5 minutes.</p>\n</li>\n<li>\n<p>Transfer chicken pieces and zucchini rounds to a warm serving dish.</p>\n</li>\n<li>\n<p>Pour off the fat from the skillet and add the butter. Add shallots and cook, stirring, about 30 seconds. Add broth and cook until reduced to about 1/3 cup. Add cream, stir and bring to a boil. Return chicken and zucchini pieces to the sauce and turn the pieces in the sauce. Cook about 2 minutes.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Diana Dávila’s Chiles Rellenos","slug":"diana-davilas-chiles-rellenos","yields":"8 servings","time":"2 1/2 hours","tags":["dinner","mexican"],"linkToImage":"https://static01.nyt.com/images/2018/12/12/dining/12davilarex1/merlin_147457293_04597239-7563-4b84-aa68-a9f1729e7111-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1019820-diana-davilas-chiles-rellenos?te=1&nl=morning-briefing&emc=edit_NN_p_20190524&section=aBreak","ingredientsLong":{"childMarkdownRemark":{"html":"<p>FOR THE SAUCE:</p>\n<ul>\n<li>10  plum tomatoes, diced</li>\n<li>3  pints cherry tomatoes, preferably a mix of colors, halved</li>\n<li>2  teaspoons kosher salt, more as needed</li>\n<li>¼  cup sunflower or grapeseed oil</li>\n<li>1  large white onion, diced</li>\n<li>10  garlic cloves, thinly sliced</li>\n<li>2 to 3  Serrano chiles, thinly sliced</li>\n<li>2  cups carrot juice</li>\n<li>1  cup chicken stock, preferably homemade</li>\n</ul>\n<p>FOR THE POBLANOS AND FILLING:</p>\n<ul>\n<li>2  tablespoons duck fat or sunflower oil</li>\n<li>½  large white onion, diced</li>\n<li>1  small Granny Smith apple, diced</li>\n<li>4  garlic cloves, minced</li>\n<li>1 ¼  teaspoons kosher salt</li>\n<li>¼  cup raisins</li>\n<li>2  tablespoons cider vinegar</li>\n<li>1  tablespoon light brown sugar</li>\n<li>1  pound ground pork (or use a combination of ground pork and chopped duck confit)</li>\n<li>⅛  teaspoon crushed red-pepper flakes</li>\n<li>8  poblano chiles</li>\n<li>¾  cup all-purpose flour</li>\n</ul>\n<p>FOR THE BATTER:</p>\n<ul>\n<li>4  egg yolks, lightly beaten</li>\n<li>6  egg whites</li>\n<li>Fine sea salt, as needed</li>\n<li>Vegetable or canola oil, for frying</li>\n<li>Epazote, for serving (optional)</li>\n<li>Chopped cilantro, for serving</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Prepare the sauce: In a large bowl, toss plum and cherry tomatoes with 1 teaspoon salt. Use your hands to smush the tomatoes until their skins soften and break apart, then let sit for 20 minutes.</p>\n</li>\n<li>\n<p>Meanwhile, in large pot or Dutch oven, heat oil over medium heat. Add onion, garlic, sliced chiles and 1/2 teaspoon kosher salt. Cook, stirring occasionally, until vegetables are softened but not browned, 8 to 10 minutes. Stir in tomatoes and their liquid, bring to a simmer, and continue to simmer for 20 minutes.</p>\n</li>\n<li>\n<p>Stir in carrot juice, stock and 1/2 teaspoon salt, and simmer for another 20 minutes. The sauce should be thin and brothy. Use an immersion blender (or transfer mixture to a regular blender) and blend briefly; the mixture should still be somewhat chunky. Taste and season with more salt if necessary. (Sauce can be made up to 3 days ahead.)</p>\n</li>\n<li>\n<p>Make the filling: In a large skillet, heat the duck fat or oil over medium heat. Add the onion, apple, garlic and salt, and cook, stirring, until the apples and onions soften, 8 to 10 minutes. Stir in raisins, vinegar and brown sugar, and cook until reduced to a glaze, about 4 minutes.</p>\n</li>\n<li>\n<p>Stir in pork and red-pepper flakes, and use a metal spoon to break up the pork into pieces. Cook until pork is no longer pink and much of the liquid has evaporated, about 10 minutes. Raise the heat and let the pork take on a little color at the edges, 5 to 10 minutes longer. Remove from heat. (Filling can be made up to 3 days ahead.)</p>\n</li>\n<li>\n<p>Roast the poblanos: Heat the broiler, and line a rimmed baking sheet with foil. Arrange poblanos in an even layer, and broil until blackened on one side, 4 to 6 minutes. Turn over and blacken the other side, another 4 to 6 minutes, then transfer to a large heat-proof bowl. Cover and let steam until softened, 10 to 15 minutes.</p>\n</li>\n<li>\n<p>Peel the blackened skin off the poblanos, then cut a slit in one side of each pepper and remove seeds (keep the stems). Using paper towels to wipe away the skins and slippery seeds can help with this task.</p>\n</li>\n<li>\n<p>Stuff the poblanos with the filling, folding poblano seams together. Place flour on a plate, and gently roll stuffed peppers in flour to coat. Transfer to a rimmed baking sheet and freeze for 20 to 30 minutes. (Freezing is optional, but this will make them easier to fry.)</p>\n</li>\n<li>\n<p>Make the batter: Place egg yolks in a large bowl and beat until frothy. Place egg whites in the bowl of an electric mixer and whip to stiff peaks. Fold the egg yolks into the whites, along with a pinch of salt.</p>\n</li>\n<li>\n<p>Heat 1 1/4 inches of vegetable oil in a large skillet over medium heat (it’s hot enough when a drop of batter sizzles in the oil). When hot, dip one pepper by its stem into egg batter, then transfer to hot oil. Fry until golden on all sides, about 3 to 4 minutes per side. Repeat with remaining peppers, making sure not to crowd the pan. Transfer fried peppers as they cook to a wire rack placed over a rimmed baking sheet, and immediately sprinkle with salt.</p>\n</li>\n<li>\n<p>When all the peppers are fried, reheat sauce. Lower peppers into sauce and simmer for 2 to 3 minutes, so the batter absorbs the sauce. Transfer to serving plates and spoon more sauce on top. Sprinkle with epazote, if using, and cilantro.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Loaded Sweet Potatoes With Black Beans and Cheddar","slug":"loaded-sweet-potatoes-with-black-beans-and-cheddar","yields":"4 servings","time":"50 minutes","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2018/09/21/dining/sj-sweet-pots-bb-cheddar/sj-sweet-pots-bb-cheddar-articleLarge-v2.jpg","source":"https://cooking.nytimes.com/recipes/1019600-loaded-sweet-potatoes-with-black-beans-and-cheddar","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>2 medium sweet potatoes (8 to 10 ounces each), scrubbed and dried</li>\n<li>1 tablespoon olive oil</li>\n<li>Kosher salt</li>\n<li>1 cup cooked black beans (if canned, rinsed and drained)</li>\n<li>1 cup shredded sharp Cheddar</li>\n<li>Black pepper</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>Heat the oven to 425 degrees and line a sheet pan with parchment paper. Halve sweet potatoes lengthwise, then brush all over with olive oil and sprinkle both sides with salt.</li>\n<li>Place cut side down on prepared sheet and roast for 30 to 40 minutes, or until completely cooked through. Take sweet potatoes out of the oven, turn them over and let cool slightly. Use a fork to rough up the flesh and slightly flatten the potatoes. Season with salt and pepper.</li>\n<li>Divide half the cheese among the potato halves. Spoon the black beans over them, then cover with the remaining cheese. Return the pan to the oven and bake for another 5 minutes, until the cheese has melted and the beans have warmed through. Season with salt and pepper. Serve warm.</li>\n</ol>"}}}},{"node":{"title":"Roasted Salmon with Toasted Sesame Slaw","slug":"roasted-salmon-with-toasted-sesame-slaw","yields":"4 servings","time":"25 minutes","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2018/08/21/dining/chun-salmon-and-slaw-horizontal/chun-salmon-and-slaw-horizontal-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1019501-roasted-salmon-with-toasted-sesame-slaw","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>4 (6-ounce) skin-on salmon fillets</li>\n<li>3 tablespoons canola oil</li>\n<li>Kosher salt and black pepper</li>\n<li>3 tablespoons sesame seeds</li>\n<li>5 tablespoons toasted sesame oil</li>\n<li>½ cup finely chopped scallions</li>\n<li>2 tablespoons peeled, grated ginger</li>\n<li>2 tablespoons lemon juice</li>\n<li>1 tablespoon mayonnaise</li>\n<li>½ teaspoon grated garlic</li>\n<li>3 cups bean sprouts (about 6 ounces)</li>\n<li>1 cup shredded cabbage (about 3 ounces)</li>\n<li>1 cup shredded carrots (about 3 ounces)</li>\n<li>1 (15 1/2-ounce) can chickpeas, drained and rinsed</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Heat oven to 425 degrees. Arrange salmon on a rimmed baking sheet. Rub with 1 tablespoon of the oil and season with salt and pepper. Roast until opaque and medium throughout, about 10 minutes.</p>\n</li>\n<li>\n<p>Meanwhile, in a small skillet, toast the sesame seeds over low heat, stirring, until golden, about 3 to 4 minutes; scrape into a large bowl. Add sesame oil, scallions, ginger, lemon juice, mayonnaise, garlic and remaining 2 tablespoons oil; season with salt and pepper. Whisk to combine. Reserve 1/4 cup of the vinaigrette in a small bowl.</p>\n</li>\n<li>\n<p>To the large bowl, add bean sprouts, cabbage, carrots and chickpeas, and season with salt and pepper. Mix well.</p>\n</li>\n<li>\n<p>Spoon reserved vinaigrette over the salmon and serve with the slaw.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Slow-Cooker Butter Chicken","slug":"slow-cooker-butter-chicken","yields":"4 to 6 servings","time":"About 5 hours","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2017/07/12/multimedia/12crowdrex-copy/12crowdrex-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1018803-slow-cooker-butter-chicken","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>3  tablespoons vegetable oil</li>\n<li>1  medium yellow onion, diced</li>\n<li>3  cloves garlic, finely chopped</li>\n<li>3  tablespoons grated ginger</li>\n<li>1  tablespoon garam masala</li>\n<li>1  6-ounce can tomato paste</li>\n<li>¾  teaspoon kosher salt</li>\n<li>3  pounds boneless, skinless chicken thighs or breasts, cut into 2-inch pieces</li>\n<li>1  teaspoon lime zest</li>\n<li>1  tablespoon lime juice</li>\n<li>1  cup coconut milk (if necessary, whisk to combine the liquid and solids before measuring)</li>\n<li>½  cup chicken stock</li>\n<li>¼  cup cilantro leaves, for garnish (optional)</li>\n<li>Cooked basmati or jasmine rice, for serving</li>\n<li>Naan, for serving (optional)</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>In medium skillet, heat oil over medium-high heat. Add onions to skillet, and cook until softened, about 3 minutes. Reduce heat to medium, add garlic and ginger, and cook another 2 minutes. Add garam masala, tomato paste and salt; cook and stir 2 minutes.</p>\n</li>\n<li>\n<p>Place chicken pieces in a slow cooker, then add tomato paste mixture, lime zest and juice, coconut milk and chicken stock. Stir everything together, cover and cook on low heat setting for 4 1/2 to 5 hours, until the chicken is cooked through. (You may let it cook up to 7 hours if necessary, but the chicken may be very soft and shred.) Garnish with cilantro and serve with basmati or jasmine rice, and naan if you have some.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Spicy Lightly Pickled Cucumbers","slug":"spicy-lightly-pickled-cucumbers","yields":"8 servings","time":"15 min prep, 1-6 hours chill","tags":["snack"],"linkToImage":"https://assets.bonappetit.com/photos/5bec46ad77ffda5e6a77f461/1:1/w_828,h_828,c_limit/spicy-lightly-pickled-cucumbers.jpg","source":"https://www.bonappetit.com/recipe/spicy-lightly-pickled-cucumbers","ingredientsLong":{"childMarkdownRemark":{"html":"<p>2 lb. medium Persian cucumbers (about 12), cut lengthwise into spears\n¼ cup white wine vinegar or unseasoned rice vinegar\n1 tsp. sugar\n¾ tsp. crushed red pepper flakes\n2 tsp. kosher salt, plus more\n2 Tbsp. chopped dill\n2 Tbsp. fresh lemon juice</p>"}},"preparation":{"childMarkdownRemark":{"html":"<p>Toss cucumbers in a large bowl with vinegar, sugar, red pepper flakes, and 2 tsp. salt. Chill, tossing once, at least 1 hour and up to 6 hours.</p>\n<p>Just before serving, add dill and lemon juice and toss to combine. Taste and season with more salt if needed.</p>"}}}},{"node":{"title":"Spicy Slow-Roasted Salmon With Cucumbers and Feta","slug":"spicy-slow-roasted-salmon-with-cucumbers-and-feta","yields":"4 to 6 servings","time":"30 minutes","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2018/11/27/dining/as-chile-roasted-salmon/as-chile-roasted-salmon-articleLarge-v2.jpg","source":"https://cooking.nytimes.com/recipes/1019789-spicy-slow-roasted-salmon-with-cucumbers-and-feta","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>¾  cup extra-virgin olive oil</li>\n<li>2 ½  teaspoons red-pepper flakes</li>\n<li>½  teaspoon smoked paprika</li>\n<li>1  tablespoon fennel seeds, crushed</li>\n<li>1  tablespoon coriander seeds, crushed</li>\n<li>Kosher salt and black pepper</li>\n<li>1  (2-pound) skinless salmon fillet</li>\n<li>1  large English cucumber or 3 Persian cucumbers</li>\n<li>4  ounces feta, crumbled (about 1 cup)</li>\n<li>¼  cup parsley leaves</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Heat the oven to 300 degrees. In an ovenproof skillet large enough to hold the salmon, combine olive oil, red-pepper flakes, paprika, fennel seeds, coriander seeds and a pinch each of salt and pepper. Cook over low heat, stirring occasionally, until fragrant and just simmering, about 5 minutes.</p>\n</li>\n<li>\n<p>Pat the salmon dry, then sprinkle with salt and place in the spiced oil flesh side up. Spoon some of the oil over the salmon, then bake, basting occasionally, until cooked through, 15 to 25 minutes. (You will know if the salmon is done when the fish flakes when cut into with a knife or fork or when an instant-read thermometer inserted into the thickest part reaches 120 degrees.)</p>\n</li>\n<li>\n<p>While the salmon roasts, peel the cucumber and cut into bite-size pieces. Sprinkle with salt.</p>\n</li>\n<li>\n<p>Break the salmon into large pieces on a serving platter. (Alternatively, you can make the salmon in advance, and eat it at room temperature.) Scatter the cucumbers around the salmon, then top with feta and parsley. Drizzle chile oil over everything to taste. (You will have more than you need — dip bread into any remaining oil.)</p>\n</li>\n</ol>"}}}},{"node":{"title":"Stir-Fried Sesame Shrimp and Spinach","slug":"stir-fried-sesame-shrimp-and-spinach","yields":"3 to 4 servings","time":"About 15 minutes","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2012/04/13/health/nutrition/13recipehealth/13recipehealth-articleLarge-v3.jpg","source":"https://cooking.nytimes.com/recipes/12382-stir-fried-sesame-shrimp-and-spinach","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>1 pound large shrimp, peeled and deveined</li>\n<li>Salt to taste</li>\n<li>⅛ teaspoon sugar (leave out for diet friendly!)</li>\n<li>2 tablespoons canola oil or light sesame oil</li>\n<li>1 tablespoon minced ginger</li>\n<li>1 tablespoon minced garlic</li>\n<li>¼ to ½ teaspoon crumbled dried red chili</li>\n<li>2 tablespoons sesame seeds</li>\n<li>1 generous bunch spinach (about 1 pound), stems trimmed at the end, rinsed in 2 changes water</li>\n<li>2 teaspoons dark sesame oil</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Place the shrimp in a large colander and rinse with water. Sprinkle generously with salt and toss together for about a minute. Rinse with water and repeat. After rinsing one more time, drain on paper towels. Pat dry with more paper towels.</p>\n</li>\n<li>\n<p>Combine 1/4 to 1/2 teaspoon salt (to taste) and the sugar in a small bowl and place close to your wok.</p>\n</li>\n<li>\n<p>Heat a 14-inch flat-bottomed wok over high heat until a drop of water evaporates within a second or two when added to the pan. Swirl in 1 tablespoon of the oil by adding it to the sides of the pan and swirling the pan, then add the garlic, ginger and chili flakes and stir-fry for no more than 10 seconds. Push to the sides of the pan and add the shrimp in one layer. Let cook undisturbed for 1 minute, then add the remaining oil and stir-fry for 1 minute.</p>\n</li>\n<li>\n<p>Add the sesame seeds and spinach and stir-fry for 1 minute, until it has begun to wilt but the wilting is still uneven. Add the salt and sugar, sprinkling it evenly over the spinach, and continue to stir-fry until the spinach has wilted but is still bright and the shrimp are cooked through and bright pink, about 2 more minutes. Remove from the heat, drizzle on the sesame oil, toss together and serve, with rice, noodles or other grains.</p>\n</li>\n<li>\n<p>Advance preparation: You can prepare the shrimp through Step 1 several hours ahead.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Summer Minestrone with Fresh Basil","slug":"summer-minestrone-with-fresh-basil","yields":"6 - 8 servings","time":"1 hour","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2008/08/12/health/nutrition/12minestrone.jpg/12minestrone.jpg-articleLarge.jpg","source":"https://www.nytimes.com/interactive/projects/well/healthy-recipes/recipes/summer-minestrone-with-fresh-basil","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>1 tablespoon olive oil</li>\n<li>1 medium onion, chopped</li>\n<li>2 medium carrots, peeled and chopped</li>\n<li>1 celery stalk, chopped</li>\n<li>Salt</li>\n<li>4 large garlic cloves, minced or pressed</li>\n<li>1 pound tomatoes, peeled, seeded, and chopped, or 1 (14-ounce) can chopped tomatoes, with liquid</li>\n<li>1 medium turnip, peeled and diced</li>\n<li>¾ pound zucchini, diced</li>\n<li>A bouquet garni consisting of 1 Parmesan rind, 1 bay leaf, 3 sprigs parsley and 3 sprigs thyme, tied together with kitchen string or tied into a piece of cheesecloth</li>\n<li>1 (15-ounce) can cannellini or borlotti beans, drained and rinsed</li>\n<li>6 ounces green beans, cut into 1-inch lengths</li>\n<li>½ cup soup pasta, such as elbow macaroni, or broken spaghetti, or 3/4 cup penne</li>\n<li>Freshly ground pepper to taste</li>\n<li>¼ cup slivered fresh basil leaves, or 1/2 cup pistou (recipe follows)</li>\n<li>Freshly grated Parmesan for garnish</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Heat the olive oil over medium-low heat in a large, heavy soup pot or Dutch oven and add the onion, carrots, and celery. Cook, stirring, until beginning to soften, about 3 minutes, and add 1/2 teaspoon salt. Continue to cook, stirring often, until tender, about 5 more minutes. Add the garlic, stir together for about a minute, and stir in the tomatoes. Cook, stirring, until the tomatoes have cooked down and smell fragrant, about 10 minutes. Stir in 2 quarts water, the turnip, zucchini, and the bouquet garni, and bring to a simmer. Add 2 teaspoons salt, reduce the heat to low, cover and simmer 45 minutes. Stir in the canned beans. Taste and adjust salt. Remove the bouquet garni.</p>\n</li>\n<li>\n<p>While the soup is simmering, bring a pot of salted water to a boil and add the green beans. Boil 5 minutes, until just tender but still bright green. Transfer to a bowl of ice water, allow to cool, and drain. Retain the cooking water in case you want to thin out the soup later. </p>\n</li>\n<li>\n<p>Add the pasta to the soup and simmer another 10 minutes, or until the pasta is cooked al dente. Stir the cooked green beans into the soup. Grind in some pepper and taste and adjust seasonings. It should be savory and rich-tasting. </p>\n</li>\n<li>\n<p>Stir in the basil or pistou, or place a spoonful of pistou in each bowl and stir in. Serve in wide soup bowls, with a sprinkling of Parmesan over the top.</p>\n</li>\n</ol>"}}}},{"node":{"title":"The Greenest Green Salad","slug":"the-greenest-green-salad","yields":"4 to 6 servings","time":"20 minutes","tags":["side"],"linkToImage":"https://static01.nyt.com/images/2018/04/29/magazine/29mag-eat1/29mag-eat1-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1019284-the-greenest-green-salad","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>2  cups snap peas, trimmed</li>\n<li>2  hearts of romaine lettuce, washed and cut into bite-size pieces</li>\n<li>2  Persian or Japanese cucumbers, diced</li>\n<li>2  green onions, thinly sliced</li>\n<li>1  ripe avocado, cubed</li>\n<li>1  recipe green goddess dressing</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Line a large plate with paper towels. Set aside. Bring a medium saucepan of generously salted water to a boil over high heat. Add the snap peas, and cook until just tender, about 90 seconds. Use a strainer to remove the peas onto the prepared plate, and spread out in a single layer. Allow to cool and dry completely (the dressing won’t stick to a wet snap pea). Cut each pea in half crosswise on the bias.</p>\n</li>\n<li>\n<p>In a large bowl, combine the snap peas, romaine, cucumbers and green onions. Mix well to combine. Add the avocado and about half the dressing. Mix gently with your hands until the salad is well coated with dressing, adding more if necessary. Taste, and adjust seasoning with salt and pepper. Serve cold, immediately. Cover and refrigerate remaining dressing for up to 1 week.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Tomato and Pomegranate Salad","slug":"tomato-and-pomegranate-salad","yields":"Serves 6","time":"30 minutes","tags":["side"],"linkToImage":"https://static01.nyt.com/images/2016/05/22/magazine/22feastrecipes3-pomegranatesalad/22feastrecipes3-pomegranatesalad-articleLarge-v3.jpg","source":"https://cooking.nytimes.com/recipes/1018121-tomato-and-pomegranate-salad","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>2  pints mixed small or cherry tomatoes, of varying colors</li>\n<li>2  teaspoons za’atar</li>\n<li>3 ½  tablespoons extra-virgin olive oil</li>\n<li>Seeds from 1 pomegranate</li>\n<li>½  yellow bell pepper, seeds removed and very thinly sliced</li>\n<li>½  small red onion, peeled and very thinly sliced</li>\n<li>⅓  cup loosely packed fresh basil leaves, torn into pieces</li>\n<li>⅓  cup loosely packed fresh mint leaves, torn into pieces</li>\n<li>1 ½  teaspoons freshly squeezed lemon juice</li>\n<li>Flaky sea salt</li>\n<li>3 ½  ounces manouri or feta cheese, broken into small chunks</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Halve or quarter the tomatoes so that they are all roughly the same size, and place them in a large mixing bowl.</p>\n</li>\n<li>\n<p>Mix the za’atar with 1 1/2 tablespoons of olive oil, and set aside.</p>\n</li>\n<li>\n<p>To the bowl with tomatoes, add the pomegranate seeds, sliced pepper and onion, the herbs, lemon juice, the remaining 2 tablespoons of oil and 1 teaspoon of salt. Gently mix the salad, then transfer it to a large shallow bowl or serving platter, and dot it with the cheese. Drizzle the za’atar mixture over the salad and serve.</p>\n</li>\n</ol>"}}}},{"node":{"title":"Vegan Thai Curry Vegetables","slug":"vegan-thai-curry-vegetables","yields":"4 servings","time":"1 hour","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2018/12/22/dining/el-vegan-thai-curry-vegetables/el-vegan-thai-curry-vegetables-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1015694-vegan-thai-curry-vegetables","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>One 13 1/2-ounce can coconut milk (do not shake can)</li>\n<li>½  cup vegetable stock</li>\n<li>4  teaspoons soy sauce or tamari soy sauce</li>\n<li>4  teaspoons palm sugar or brown sugar</li>\n<li>6  tablespoons Thai green curry paste, like Thai Taste, Maesri, and Thai Kitchen, none of which have shrimp or fish paste</li>\n<li>½  cup diced (1/2 inch) onion</li>\n<li>⅔  cup diced (1/2 inch) red bell pepper</li>\n<li>⅔  cup diced (1/2 inch) zucchini or other summer squash</li>\n<li>⅔  cup diced (1/2 inch) peeled sweet potato</li>\n<li>⅔  cup sliced bamboo shoots, rinsed and drained</li>\n<li>1  cup green beans, trimmed and cut into 1 1/2 inch lengths</li>\n<li>⅔  cup diced (1/2 inch) Asian eggplant</li>\n<li>1  lime</li>\n<li>8  large basil leaves, cut into thin chiffonade</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Open the can of coconut milk without shaking it. Spoon 6 tablespoons of the coconut cream from the top of the can into a medium saucepan. Pour remaining contents of can into a medium bowl, and mix well. In a medium bowl, combine vegetable stock, soy sauce, and palm or brown sugar. Stir until the sugar is dissolved.</p>\n</li>\n<li>\n<p>Place saucepan of coconut cream over medium-high heat until it begins to bubble. Add curry paste and reduce heat to medium-low. Stir constantly until very fragrant, about 3 minutes; adjust heat as needed to prevent burning. Add onion, red pepper, zucchini, sweet potato, bamboo shoots, green beans, and eggplant. Stir until vegetables are hot, 2-3 minutes. Stir in coconut milk, bring the mixture to a boil, and reduce heat to low. Simmer, uncovered, until the vegetables are tender, about 10 minutes.</p>\n</li>\n<li>\n<p>Add the soy sauce mixture and a generous squeeze of fresh lime juice to taste; you may use the juice of an entire lime. Stir and mix well. Add up to 1/4 cup water if the curry seems too thick.</p>\n</li>\n<li>\n<p>To serve, place the curry in a warm serving bowl and garnish with the basil chiffonade. If desired, serve over jasmine rice.</p>\n</li>\n</ol>"}}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}