{"data":{"site":{"siteMetadata":{"title":"Feed the Gillmores"}},"contentfulRecipe":{"title":"Cinnamon Roll Bread","slug":"cinnamon-roll-bread","yields":"One 9-inch loaf","time":"1 hour 30 minutes, plus 2 hours’ rising","tags":["breakfast"],"linkToImage":"https://static01.nyt.com/images/2019/04/15/dining/em-cinnamon-roll-bread/merlin_153444012_bb5224dc-cced-491b-ae17-9c06436b1a04-articleLarge.jpg","source":"https://cooking.nytimes.com/recipes/1020179-cinnamon-roll-bread","ingredientsLong":{"childMarkdownRemark":{"html":"<h3>FOR THE DOUGH:</h3>\n<ul>\n<li>Nonstick cooking spray</li>\n<li>1  cup/240 milliliters whole milk</li>\n<li>3  cups/385 grams all-purpose flour</li>\n<li>⅓  cup/65 grams granulated sugar</li>\n<li>2  teaspoons instant yeast</li>\n<li>½  teaspoon fine sea salt</li>\n<li>6  tablespoons/85 grams unsalted butter (3/4 stick), at room temperature</li>\n<li>1  large egg, at room temperature</li>\n</ul>\n<h3>FOR THE FILLING AND FINISHING:</h3>\n<ul>\n<li>8  tablespoons/115 grams unsalted butter (1 stick), melted</li>\n<li>⅔  cup/145 grams light brown sugar</li>\n<li>¼  cup/30 grams all-purpose flour, plus more for rolling</li>\n<li>2 ½  teaspoons ground cinnamon</li>\n<li>½  teaspoon vanilla extract</li>\n<li>¼  teaspoon fine sea salt</li>\n<li>1  large egg</li>\n</ul>\n<h3>FOR THE GLAZE:</h3>\n<ul>\n<li>1  cup/125 grams confectioners’ sugar</li>\n<li>3  tablespoons heavy cream, plus more as needed</li>\n<li>1  teaspoon vanilla extract</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Grease a 9-inch loaf pan with nonstick cooking spray and line with a parchment paper sling, leaving a 2-inch overhang on the long sides.</p>\n</li>\n<li>\n<p>Pour the milk into a small pot and heat over low until it’s just warm to the touch (about 95 degrees). If needed, let cool to the correct temperature before using.</p>\n</li>\n<li>\n<p>While the milk heats, in the bowl of an electric mixer fitted with the dough hook, mix the flour, granulated sugar, yeast and salt to combine. Add the warm milk, butter and egg and mix on low speed until the dough comes together, about 3 minutes. Scrape the bowl well, and mix on medium speed for another 3 minutes.</p>\n</li>\n<li>\n<p>Transfer to a lightly greased medium bowl and cover with plastic wrap. Let rise until puffy and almost doubled in size, 45 minutes to 1 hour.</p>\n</li>\n<li>\n<p>While the dough rises, make the filling: In a medium bowl, whisk the butter and brown sugar until well combined. Whisk in the flour, cinnamon, vanilla and salt until well incorporated.</p>\n</li>\n<li>\n<p>When the dough has risen, roll it out into into a rectangle (about 12 by 20 inches) on a lightly floured surface using a lightly floured rolling pin. Spread the filling over the dough in an even layer all the way to the edges. Starting on one of the long sides, tightly roll up the dough crosswise into a 20-inch log. Gently stretch the log to make it about 24 inches long.</p>\n</li>\n<li>\n<p>Use a sharp or serrated knife to cut the dough into 16 1 1/2-inch-thick pieces. Arrange the cinnamon rolls in the loaf pan: Place two rows of six pieces each at the bottom of the pan, side-by-side, seam-side down and tightly packed with the swirls facing the ends of the pan. Arrange the remaining four pieces in the center on top of those on the bottom.</p>\n</li>\n<li>\n<p>Loosely cover the loaf with plastic wrap and let rise until the dough comes about 1 inch over the top edge of the pan, about 1 hour (it can be more if your room temperature is cooler). Toward the end of the rise time, heat the oven to 350 degrees.</p>\n</li>\n<li>\n<p>Make an egg wash by lightly beating one egg and 1 tablespoon water together. Brush the loaf with the egg wash, then bake until the loaf has an internal temperature of 200 degrees, about 50 to 55 minutes. The loaf will brown quickly; tent it with foil after 20 to 25 minutes for the remainder of baking time.</p>\n</li>\n<li>\n<p>While the loaf bakes, make the glaze: In a medium bowl, whisk the confectioners’ sugar, cream and vanilla to combine. The mixture should be thick, more like a frosting than a glaze. Add more cream if needed to achieve a smooth texture. Cover with plastic wrap, pressing the wrap into the surface of the frosting so the surface doesn’t harden.</p>\n</li>\n<li>\n<p>Let the bread cool in the pan for 15 minutes. Use a small offset spatula to loosen the loaf from the short edges of the pan, then lift out the loaf using the parchment paper and cool for at least 30 minutes on a cooling rack before applying the frosting. Spread the frosting in an even layer over the surface of the loaf.</p>\n</li>\n</ol>"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"cinnamon-roll-bread"}}