{"data":{"site":{"siteMetadata":{"title":"Feed the Gillmores"}},"contentfulRecipe":{"title":"Summer Minestrone with Fresh Basil","slug":"summer-minestrone-with-fresh-basil","yields":"6 - 8 servings","time":"1 hour","tags":["dinner"],"linkToImage":"https://static01.nyt.com/images/2008/08/12/health/nutrition/12minestrone.jpg/12minestrone.jpg-articleLarge.jpg","source":"https://www.nytimes.com/interactive/projects/well/healthy-recipes/recipes/summer-minestrone-with-fresh-basil","ingredientsLong":{"childMarkdownRemark":{"html":"<ul>\n<li>1 tablespoon olive oil</li>\n<li>1 medium onion, chopped</li>\n<li>2 medium carrots, peeled and chopped</li>\n<li>1 celery stalk, chopped</li>\n<li>Salt</li>\n<li>4 large garlic cloves, minced or pressed</li>\n<li>1 pound tomatoes, peeled, seeded, and chopped, or 1 (14-ounce) can chopped tomatoes, with liquid</li>\n<li>1 medium turnip, peeled and diced</li>\n<li>¾ pound zucchini, diced</li>\n<li>A bouquet garni consisting of 1 Parmesan rind, 1 bay leaf, 3 sprigs parsley and 3 sprigs thyme, tied together with kitchen string or tied into a piece of cheesecloth</li>\n<li>1 (15-ounce) can cannellini or borlotti beans, drained and rinsed</li>\n<li>6 ounces green beans, cut into 1-inch lengths</li>\n<li>½ cup soup pasta, such as elbow macaroni, or broken spaghetti, or 3/4 cup penne</li>\n<li>Freshly ground pepper to taste</li>\n<li>¼ cup slivered fresh basil leaves, or 1/2 cup pistou (recipe follows)</li>\n<li>Freshly grated Parmesan for garnish</li>\n</ul>"}},"preparation":{"childMarkdownRemark":{"html":"<ol>\n<li>\n<p>Heat the olive oil over medium-low heat in a large, heavy soup pot or Dutch oven and add the onion, carrots, and celery. Cook, stirring, until beginning to soften, about 3 minutes, and add 1/2 teaspoon salt. Continue to cook, stirring often, until tender, about 5 more minutes. Add the garlic, stir together for about a minute, and stir in the tomatoes. Cook, stirring, until the tomatoes have cooked down and smell fragrant, about 10 minutes. Stir in 2 quarts water, the turnip, zucchini, and the bouquet garni, and bring to a simmer. Add 2 teaspoons salt, reduce the heat to low, cover and simmer 45 minutes. Stir in the canned beans. Taste and adjust salt. Remove the bouquet garni.</p>\n</li>\n<li>\n<p>While the soup is simmering, bring a pot of salted water to a boil and add the green beans. Boil 5 minutes, until just tender but still bright green. Transfer to a bowl of ice water, allow to cool, and drain. Retain the cooking water in case you want to thin out the soup later. </p>\n</li>\n<li>\n<p>Add the pasta to the soup and simmer another 10 minutes, or until the pasta is cooked al dente. Stir the cooked green beans into the soup. Grind in some pepper and taste and adjust seasonings. It should be savory and rich-tasting. </p>\n</li>\n<li>\n<p>Stir in the basil or pistou, or place a spoonful of pistou in each bowl and stir in. Serve in wide soup bowls, with a sprinkling of Parmesan over the top.</p>\n</li>\n</ol>"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"summer-minestrone-with-fresh-basil"}}